node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 1522530
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "Z\314\253>\300\200\250=\256r\'\276\226Q\334\275\236s\307=\037B\355=\215{\233<vC\323\275\260\021\261>\3206\357\274\327\316-\275,\275\020>\353M\321\274\326\027h=\313\277\326;`\201\037>\242{B>\377O%>\257XU=\235\275G=\215\306$\276V,p\2751\270\337=\277\215\304\272\177\344\211=\252\316\363\275b\321\214\275\362H\213\275\345 ?\275#7\341\275\237\370\254\274\276,,=8\233\023\276Z\037\325<h]\312=|\031\362=\261\301\316\273\361+\207\276\333\375}\274\237V\311\275\374\332\360=|pC\276\346}\312<\037\036p>\250@%>\312q\223;5l\312=f\346 \276x\003s=\027+\333\274\312\"\033\276O\341+>y\233H=}M\231<\223=\031>\022\262\030\276\331\214e>\277\035\016>T\035\r>\201\261M\275\371\260\242\276\342P\232=&`\315\275\224\3626<*\333w>\276\367\270<:h9\276\314\037g\273\352\315\266\275\260\332S\275\256\202\231=\277\364f\275\307\313d>\350\334\222<1\207\233=\271\232h;\237\227\321\275\343\350\023>\345A_>\360;\010>\261\364\002\276R$u=\210l\303\275\247\032\212\275\367\351\362\276\224\317\004\276\325#O=iG\023\276m\3554\274\r\307\004>\025\n\010=\036s|>\355$\325\275IG\007\276v\351:>\331U\374\275^\241\023\276\301i{\275\017\267d=\200\266`\275\361\322\"=\366\253\354\275\252\202\200<\010u\364<\016\305\254\275\221\031e\275\254m\036=\026s\236\275\tm0\273\367\221\024\275 \265^\276\242-\236\274S\3671=t\240(\276\305\346\216\275G\t\202\275\233\240><\n\274m<\034\244\344\275ex\331\274e>\354\274\3472\371\274)\352\306\274\345\224\306\275\313\220\206\276j\342\315;]\356\266<)]\215\275\010g\221\275\370\025\324\276\303\356\251=\353\0331=\344\n.\275o\304\330<\357r\233>\252\325u\274$K\205\275\002\276a>K\215\374\274dl\206\2758\345@\2752\336\252\274n\305F=u\2559>\213\226^\274\315\335b=\304\003\347=:y2\274qY\001\276\254\233\005>8]\367\274\267\210\325<\227\252\323\275\325,3=f\301\325\275\016\236K\276 P\276=\321Ex\273,\367}\276\244\370]\276uC\234\275\006\203\"\276\247\r\005>J~\265\275\244\\b=\322\230\317\275{\177\320\275\227U\000\276BU\016>y\264\013=\314@\024>\331{l\276@\213,\276\364nG>kw\031\275n\005\020\276\025\370\315=X5\030=\005\337\203\275\271\220\357\275\377\t\301<{\251\243\276 \346\250\275\014\035\245\275\212K\234\275\362\207O\276P\301|\276\2441@\276\030m\344=]\242x=\033I\221>\034R~=\366\231\356\275\215B>\276\232\273\314\272\013G=\276h\247\033\276\t\364t\274\033\232\370=a\031\016\276\000\245\261\275\221\014\214\276\256\203\310\275\306\263\361\274\263\254Y=\261CO;\276\342\n=\256\277\333\274i\241\242>\302\021\'\276\241\t\337<qw{={(\n\275\305\221{=\364I\003\276\026G\006\273\006\304\020<#\244]\275l\250?\275\003-\240\275\335pQ>o\214T=\365\234\232\272!\006\313=\364\302\324\273,\221\027>r\302\037>\002\354V\275\265_\020\276\017W\300\275\360\030\225;\233\331n\275\363\355\333=F&\300<\000\314E\276RDN\274\373W\264\272\312\372\005=\316\331S\276\034\241\311\275zA\370\275_>T>\261/\026=2%\276=\206\005]\275uvP\276%\240\312\275r\366\010>U\273Y>.\252L>\350\376\354=\332 \356\275\356p\323\274\200\337\312=\247\305\221=\0364\213<5\016\331=\251T\213\275!Io=;1\025\276)D\031\276\241\351\311=\305\251\031\275\365A\264=h\202\264=~k\203\275\365\251\246=D\264\263\275\032\005\326=\272\364\364\275\010v\216>\303\323\004<\372\246;>\200\n=\276\312s9\275\360Sx=\032\236<<y\300\337\275\322\234\020\275\232rT;\320E\312\275IKM=\321\004\037\274\225\371\240\274n\226\205\2759l\r>|^e\276\307-7\276[Y\221>\210\253t=\000R\265<\321\367\312\275\035C*=\3172\222=/\350S>G\366\267\276Y\232\022\276\0347\202\275\224o\004\276\340yD=\027[B\275\341\213l\275 \371\014\275R\345\n>\200\\:>tA\254<\235\014r>SY)>m\356*\276\277\035\034=\301:\026>\265\372\274=\027z\242\276\004E\026>{\361\241\275{6\253=#\\^=;\\V=TEz>\270-\210\275\320\240\324=\255n\205\275\367\330U>\307\2039\276[\325\321\275\274t\261=\220\223b\275I-\336=\354r\313\275\251\276\241\276X\2462\274d\255\220=\300~\016\275\232\317\215=i\234\000>\214\302O\276<\261\333\273\217v\225\274\207\242\311=\321\023-<\216N:=\276)Q\276vZK\275n\007\364\275=\032\">\3058}>\214\372r<\031>\252\275K\204*<O*\317=\306Z]>\241\025\205;\253\\\361\275\004\037\330\274E\020A\274\\\244\201\275\336\375\262\275\326\034=\275!w\006\276Cp \276\037F<\276*\t\202=\315\224<\276\263\342\013>\rq\205;\207.\316=\231\257s\275\214\363\003>\315G\205>H\230\035=.\302\217<!p\256\275\231E\254\275\306.\214\275\0276E>s4\354=\3638\014<m\245\222\275\346\255\322\275\347\346V=)i/\276\027s\007\2768B\017=L\354\272=\205\221\022\276\267\342g=9\346\177\275\3366C\274\316.A\275z-\315\273\207\220L\276\302\213m\276<\215\227\275\025f\000\274=?y>$|4\275*q\357\272`\276\303\2747qH\276\215NW>\334\032\315\275\255a0>\006,w>w\227\005>N\312\356\275\230;O>\335\n->\251Oq\271)\326\255\275\014\273\035\276v\326U>!-\366=)}Z\2768\263\027>t\302\377\275I\266\340<\267E\225\275M\006\023\275\356\227\006\274.\311\364=D\361b;\251\3618\275\267\241y\275\260\240\333=7\002\007>\347Q\016\276i\363\247\274\230\230\022\274\2460\342\271\331\037T\276\205\230\235\275x\345\273=\367\335\217=\246\211->\302k\216=i.\306\275\250\244\030>[s\270\275\317^)\276\300\373\026\276\365\025C>=\260\260\275\260\243Q\276d\244%\276\313\317\006=lD\261<\235Ca\274g\310\037\276\261\337\211\275O\036\341\275Gh\366=\364s\322;\325eM\275\231\373z>e\030\220>\235\211\003=W\026\342\275 \024\201>\223\343\037\276b\317b\276\365\342\000\276^\316\r>\230\372a>\306P\025>l\331\256\274\237\036\327=\3440\202\276\001\\2\275\206\364_<\262\254\371\274\320k\003\275\251\362\t>L\331M>\377\013\203\275\332a\230=\002\330\314=\375\251c\274J\317\242=m^\276\275s\351\025\276\021v\303\275\232y\200>Ts\342\274A\344\t\2765\252\001=\315\024\003=i\3063\276B`\260\275Dg&=\014\034\357\275\215\2279\276E\221B<$\375\340\274$\023\345\274Y\030#=f\002H>\000o\257>\tu\030\276km\207\275S\372\366\275l2\025\274\226*\356\275\200z\003>J\037\004\275\322c\276\275\347\360\222>\233\307\247\275\200/\204<\nY\036>@\037\301=\363O\205=\250\003!=S\3738\276lE\347\275\027G\305\27541\020<\371\202w\273\276\324E>&\252\024>\030\374\263\275\263.g>b<f=g\3335\276\367\237c\274|\267\215=\315:\\=\30773<\003?o<\305X\003>\347e\000\276+\274\364=#\303)\276_\017\230<?Q\236\2756ZD\276\243\253I\274J\366r\276\"\356@>)K\005>\373\263\343\275Wk\033\276\ny\231\275\344\317\002=\351b\240=\272vh=#\341\">\373\360\316\275\021\000\271>\016\022\255=\035\377\032>\177\300\005\276si\322<\374g\347\2758\t\032<r\376N>\221E7=\020\322\301\271\017\316\221\275\327\036\343<K\212r>\034\013\017=Q*\264\275\255\244\247\274\031H\013\274\036\262\372=\230\240\222=\366\312\003>\344\016\001\273/\203\326=\372\224\021;\003\017\\\275\267\275\372\275\327\277\357\275\335\212I>\024\021\037\2754V\333=\207S\305\275\014b@\275R\004\212>\260X-\276x\232\266=@}\246=/\270\225=\274\330\340<\273\2752>O<\236\276Sn\\<EJ\331\275\275@\364=\246\"F\275\325\277T\275\201\016g\276\2201\356<c+\245=\343\353\300=\r\267\016>\t(\016>\203\003\014\276\377\212\204\276\366\360\257\275iO\201\275*v\240<\232\007U\276\020\333,>\034 \273\275y\202\001>\347\tW>\000y6\276)nW=\221#\232\274=\321]>]\344\020\276\256\317\004\276\350\342\315\275K\315\203<\277g\237=\246\327\337\274\273\355U=\350\031\231\276\360\322\017\276\266t\342;\254\266\213=\301\234\241<\246\324\243\276\0036W>O\252\234=\271o\265;ut\366\275\024,\344=\024c\336\271;Z\014\276\335\\,;\364\257\376\275dr\212\276\366\000\">\217\264\025\275\274,o\275\n\300 \276\350\353\275\274\024\240\276<\337\246\236<\331[\272=\'0C\275\341(\233\275Yi\027\2765_C\276\244g\177\273d%\251<\233sW=N<\324=,\322\370\274[\0041\276eS\300\271\177\254\243\276\347O\310=\205\330t=Xy\240=\343\343\271<U\010\313\275\345\207\301\275\337\016\304=\2657\361<\200\210\000>\245\013\246= \265#> \315\'=\250W2>Rd\313;2\204\024<\242\323O<:tt<l\206\273\276\303\273%>\272@\317=\363*\014\276,8\023>\351\345\"\276\242\321\276=Q\004\305=4\361\244\276\002\003\242\275\236\335\365\275\231\3769\275\254\020\247\273\036\341\000\276*yg<\004\341O>\221\340\226\275\305\243\n>\353\267\376\273Cml\275\213\254f\276\260\205\344\275g\226\314<mM\306\275\315\276!>\333\016\207<\335\200[=\201\230\357\275\251Gp\275\366\252\016=\033(\004\276,K\310\275B\025\337\275W;_<\202\344\310;\365b\211\275\246z\262\276\003~\000\2741t(\276\320\366\005=\026\353\330\272\317>z\274\317\223\322=\353\301I=\317\014\246>\352X\263:\2640\257=2I\r=\277\312\242=n\273<;:EW\275\033W\354=\"\347W>\351W\343\274>\010=;g\303\242=Y\370[\274z\341G\275ne\361\275\221\242\241=N\257i>\007A\025\275)\366!>(\332\365\275\345\003\343\275\331N\322=\"\310\317\275\365J\327\275q\362\214\275\311K\213\276\235\336\330\274\277I&\276\337\2528=\034\rq\275\264\236\216>\004\340\332\2753\210\307\275\265\302\r=\200Y\304=\321S\356=+rA>\350\2170\276\272\271\003>\320\027\356\274\202\331\327=c:q=%}\2267l\271/>K@\207>J+#>P\232\341\274\352\226\032>\204\270\351;\350\214\332\274\2244\214\275\343y\303\275\2423]\276\0337A\276\337\221\347=\002\243x\274\032\271\277\275\373\004*\276\254B\000\2757=\303<\344\344\246\275\002e\001>xQ\304\274\250A\305:\020)\263>\255\270-\276\224\374&>\264\301\267\275\265\000!:\251\352(\276\221$\016=\014^\340\275\277]R\275\253\356\342\272\314\251s>\224<\037>\231RA=\233$V>f\321\222=\332\353\266\275\242\362\245=\202\267\234=d\353\023>\020#\034\276\272m\262\275I\270\362<\355\340\354\275F\r\004\273t+\013\276i\204\356\272\212I\270\275\330#4\276g\031\216>U\204\013>\217\334_>\027i\005<G@\312=\346\314:\276\253+;>\207q]\275\351A\026<3t\261\275,\255K>\027\315\032\276\037!s9\261~\220=\262\231G\276t\347z;\006\246\323\275>`\221=p\226F=\374L\374=\034\331\016>\237I\207\273XL\224=\2044\267=vG\351=U\250\006=\205\347(>\030_\264>\333\314\214;\355]]=\"\033\036\276\206N\035\2769\337k<\222\350\314:\262F4\276\023G\326=\343\220%>4zY>r\033f<\347\300\223<\rV\350\274\330\315\033\275VvC=\227k\250;Z\342]<U4/>j<\327\274\035\251\214=\314\322\020>4Y\372=\235\325\332\275\352\243\t\275\274\252\230\275\213\242\344\275R\347\224=\300Zg>\361\202\243=\261\212\364=\032\320\013\275\220@\341=0\023A>7\022\222>p2E\275\035[0>,\241\037>\'\274\260=i\334\260=\244h\305<\347\340\037\274\241\264>\276\025\200\000=\026X`\275\034\244K\276c\356\251\276\274=\372\275I\n.=\003FQ=\201\004\333\275\037o\035\276\222\326 >\311!\233=\274\377,\275Z\006\326\275\020\240\203>\362\364j\274`\267\326\275\346\357:\276\004\005\036\276\277\346\342\275\273\257a>\351\211j=\252K\236=\377M\337=!\316\002\276\372\035n\275Fe\213\275C\205\252\274`\251\010>\024_\222\273\350\201\031>V\363\200\275&\234\231=\233\261:\275!\347+\276*>\251<\343\003\263=.\235\253\274\235$\265<c\177\340\275\036I\301\276\374\267k\276\005+!\275f\326s=\302\350\013>\221\326\246\276\216\201I>I\001U\275\225\246\307\274\356o\231\272\276\253\255\274g\000-\275\r\000\324=3\351S=\361\352\037\274k\304N\275\314\373\371=\341\202\314\274\234\031\025\2759B\005>\216\310`=\365S\204>\245.\360\274\357\000R>b\244\024\274Wl(\276t_\222=|\201\022>|\206\273;\305\213\240\275~\235\306=\260\314\004\276[t\242=\264\350$>\355\007\210\275\257\215\254\275\227y\002\276w\302\213\275\326(V>m\'\232\276\326\006V\275\034\014\373=\302\351\320=\217\365/\276,cX<\r>6=\201\316$=\255\"\274\275(@\311=1UK\276&\3337>\177\362\317\275Jt\203\275\332$\362=A\036\214\275M\354?\276\036\347\255\273\374:1<S\276@>\354O\204<\304[\260\275\317H\230\275v\014q<8.Z>,\343\2679\377\354\317\275\244WN\2761\355/>\227M&8\025\350^=O\315K\276\037\336\302\275\005\337\016\274C5\305=\212\307\251>\212vo\275X\324&\276:\327\224\275[AT>\206\332\206=\210L\004>:D2\276\324\205\311\274.\314\304\275\221\307\232=\313\303\221=\027\243\004\276\226\324E\276\301!\303=\\Jl\275\303\333R=\026\372F=\r+\216\27607\037=\347\231\264>\324(s=\323Y.=\263\001\267\274\032\226\356=\211\014y\275f7\002>\022\262>=m\200q\274F\177%\276\325\371\031>L\225M>\200H\315=\321b\244>Aii<,\302\021\276\177*\017\276\034\264\022=\034\341\204>Sz\253\275y\211\n>\225\205\004<&\356\010\275C-\212>=\021\301\275\254i\002>Lf^\2759\016\213=\246*\001\2767\250+>\320Lo=c\235!\276t\215\003>aw\246\274\305\256\006\276\377\000_\275\315$\235=P\372\001>\222\003`\275\341\303\027>\275\343l=\n\275:=\305\310O>\274n\177>\362-\251\275\341\351\001\276Y\000\206><&\266\275\325\364\343\275\027\301\310\2729(\277<\327\3670>\272\324\"\276(\336\357\274\227\362\222\275\330\037\264\275.\320b=HE\306\274\244G!\276\006\370\274\274x\010\247\275\005r\360\275m\254F\274\240:P\276\315n\220\275Z[(=Z\302\337\274\345\216\007\275\366l\010\273\353\030F\276\357;\264=\256\247\002\276\272\234\343=f\277\202=\3367\252;eY\374=\037~\361=n\234\263\275\320\332\'>g\366\272\274h\350\027=\023\274\232<\036L\225>IU\350\275\354\201\371\274a\021/\275\222w >X\332\237\276\257\024Z<\346\226\236>\020l4>5\205(>\007\343\217;\275}i\275O\3144\275\305\343q\276845>\221\237]\275b\357\341=\212-P=_\035\022\276\025Y\301\274\'\004\201\276\312.\376<(\021\220\275\266P0\276h\t\021>TV\336\274\006\214\351\275T\301\224=\022G\t>p7\003\274F\2070=\311.\313\275qY\321=\337\346\225>\275\223\005\276\375\251\267\275JF\265=\235\r\000=\027\2741>\233\332\005\276\204\274\324=\000\325\324\275\202v\272\274dC\222\275\300\037\255<\317\232#\275\201\337\226\275#\031\236=4P\n\276\235\367\317\275\332\307\254=\364\236\324\274k\240\256\275\351\376\302\274\325\336\373=\335\251\210\273)\367]=`\236\325;\251Q\363\275\261d\245\275K\315O\275\373\347\375\274\315\177\224\275\211\276C>\005l\346<\035\227\216\275Z\313\201=\2164\303\274^\344\343\275\254\377.\276\310\212\366=\221}\216>\375\322<>\243\372\216\276m\324A=4D\322<g\314v\276I\266\354\275\373\210j=\311T\301={\277E\276\276\3507\274\353\276=\275\302c\201\275|6o\276<\n.>R\311\030\276\002[\350\275\312!\234>u\340\007>\353r\210\275\234\223\3729)l\355\275\031}\000\275\364\003!\276\276\334X=\230\257\026\276\265y\355<\246:L\276zN\234=\017u\206\276\302\\Q\276\003\256\030=\271\034\225\2749I\275\275\276S\225\275&$\365\275\245\233 ="
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_1"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_11/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_11"
  op: "StridedSlice"
  input: "net/Shape_1"
  input: "net/strided_slice_11/stack"
  input: "net/strided_slice_11/stack_1"
  input: "net/strided_slice_11/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_2"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_12/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12"
  op: "StridedSlice"
  input: "net/Shape_2"
  input: "net/strided_slice_12/stack"
  input: "net/strided_slice_12/stack_1"
  input: "net/strided_slice_12/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones/mul"
  op: "Mul"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/Less/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "net/ones/Less"
  op: "Less"
  input: "net/ones/mul"
  input: "net/ones/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/packed"
  op: "Pack"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "net/ones/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones"
  op: "Fill"
  input: "net/ones/packed"
  input: "net/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
