node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 9538746
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\032}}>;\371\231\274\321\237\341\275\346\247\304\274\334\353\237\275\363\306\t><\331\366<\214\312$=J\267\346=\332\370\217>\220\347\243=;l\211>\355#\240=RO.\275\263\262\304=\215\344\022>;\262\302\275O\367a\275pXI>Q\210,\276Qq,=\001\324\222=\340\314\214\275-{\371=\316hE\275\277\365l\276\250\366\217<\031\331\220<\267\234\273\275+\030\364\273\000\341>\273\350\247+\275\267\016C\276\255\254\320\274X\025\215\276Y\177\235=J\236\006\276\342)\240\274\3551\237\275\023\211\275=\036?Y<\325\tU\276\027\334\n\276\036\356\207<\251}>\273\334K\300=$\337\373\275\030l\333;V\205\243<\352\314\225<)w\022>3\252o\276p\224\275=\270\034\343\275\246\261:\276\032^\311\275\303A\223\276\216B9\276-}$\276\013,\271\274\306\251I\276<(\032\276\031\247\320\275K\242\\>u-\344=\244EM=K\355\031\272~\372\360\275qu\255\274\177\274I\275\001\253\215\275\027O\005>0yd\275Vk+\275k\024M>\335h\263<}E \2753B\"\276p\321\250=\003\010\317\274H\020\366=\342\334S\276\271+\312=\311\331\021\274\374\221]>=\326\267\275=r\307\275\3213\363<q\315\202>\221\252}>`\314\337<\313\013);Q\031\303=\210l\013=d@\342;\211p\315=\340\222g\276\336\343\333=\231\021\331=<\257S>\346\253\260\275[3\017=\355\363=\276^\301L=q\365\341\275\306mB\276_\033\370\275\206\343y\275\022\037\004>\006\272\246=R|;\276c0\017=\246\263\237\276\325d\205\275\266yc\275\237\323\366\274\241\244B\276 )\334=\276P\360=\310\226\372=\003\366\241\275\312\2725\2764y\357\275\231\'\255\274\255\2307\276\367r\211>\307\314\303=\r\245!\275\021\036\203>\210b\306\275\316*r=\217\367Y\276`\376s\274\314l\343\274\202\257\240<\332_\367=W\222\030\276\313j6\275Z\233\356=\300\236\307\273\322\241\020>\0065(>\343d1>\257s3=\251N\333\275\305\251\027=\301\273\266\276.\334 \275\237\240\177<\223\366\037>\325\306\000\276\211\005\010>\362\237E=\306\204\372=\272\320\205>\372\240\036\276>\204\301<\353\307\004>9j\002\275-f(=\036&?<\356\330{=\322J\021>D\374\353\275\303\021\207=;sT=\235Y&\276\016zf\275\364\350x=J\362T\275\3778\357\274\204x\350\272\026\\\235=\352\035*>Ft\370\274\032\346\031\275\370Z+==\307\265\276\232\361A\275\016{|\274\221OO\276\372\307\330\275\224;\341=w\376\244\276\311\226y>/\350\265=\016\346\014\276\365\347\232<\261\271\337\274\251\202\007<\273t\310\275D\307\026=\207\007\256\275\300.\027>\234p\001>\266v\250=A\310?\273\216\271#\275\277*\222>\305\321\342=\237\004\303\2756\351\226\275sQz;\353\232I\27538\223\275\316\321\000\2768;(>\276\014\367\275s\351\210=\000\361\247=\321x\234\2747\330\272\275\025\345\337=\355\366\342\275\017F\355=c\004,\276\316\200B=\326\022A>g[\206=\332\2112>&>\376;\216j\232=5\024\250\274{\0255>\r\276\000>\337\016t>\260\\\251={J\267<\367\216\034\276\244\373\000>\'\342D>\274Z\257;b\241\025<\206\"\250;\372\260\224>\317\177\200<\346K\030\276\213\366\'\275SoL\2765Y\247\275\236l:\275\030u\346\275\203\354\207>\315=\036;\315\370\033\276\324i\357=o\362->\242\"\325=\374\315\">\211\326U<\236\344Q=\300\307t>\343\323\026>\222\343U=\024e!\274u\271\355\2751:\316\275[\272\212=6\004\214=y\231\316\275A\344(=\r^\336\275\272\037\020=\255\226#\274r\353k=\252\035\010>\233\000>\275\201\"\246=H;g\276y\334\366\274\034Y\023\276>\312\266\276\240\220\357=\304*\347\275\024\217]\275\271\215\355\274\032a\n>io:>\214\361\205>\357~a\275B\nh\275G\206@>\026\372(=z\364\001\276N\207\024=\035\037#>b\317V>AQR\275%\270\307=T\227\202\273\234\027\010\2751\376\t\274\001\200U\276G0}\275\375Xj\276\035\216Z\274\336\264\276=&\236\257=\303\203\346\275\275\201\014>Y\317:\275y$h=\3329\262=\206\373h\275L\335g>\221-\242<\345\342\033>S\210\367=\200\263E\275\316\260\321\271\227W\003\276nZ\213=\336/+<a\207\036=\334p\316<\017\275t>q?3=\243\006\223=\3507L\273\334\327\347;\336\343\236\275y\352\014>\275\353\021\276\215\347\223>\036t\001\276\332\371#=\3513\270\276\n\362=\276W\244\006>\361\021\201=\241w\t>\217\026\215\276\3040#>\261\366\354\274\027\241\360\274\377\240\005>\271,G=S\350`\275 B\034\276\273\267{\276\244\331\331=\3634B>\354v\027=RO\203=-\2102\275\3565\206;neA\276\3724Y=\2526\002\276\374\244\'<\342$\255\275\000\'R>\311\245\267=\263\257\032\276\013\322+\276\233\231S=\023Z\t\276c\252\201=\204X_=\032H\313<\214L\026=\010;^\276\'\313\202\275>\231\">a9\227\275\275\324\276\275\247B9>\256&\236\275<\351\227\274\027R\241\274z\236\006>\337\262 >\010\376)=H\370\371=K\203\315\275\021\245\243=h\275\353=\224\234\322\275E%m>\021q\304=\034\226q\276\302_r>\334\2267>5[T\276fr\023>\214\343\304=\326qN\275\306\303\267\275\033/%>\'\271\325\275\274o\214\275\322\034^\275>b\244=\377`\222<\225R[<\004\322S\276J\312\315<H\026c\276-c[\275\025\006U\2756*\370=\215\2332\275\226\272J\274\336\327\271=\226\351m>B\3009\275D\241\276\274>@\325\275@\272\257\275\007\331\245\276\231\000J\275\026\277<\276\276G\270\275u\351A\276\254\001\227=r\224?\275\342~\366\274\261\211->\277?\345\274\031A\252\275\002E\326<|\272\351\274\266>Y<T\2151\276\321f\017>|\272U\275\217\345\362\274T/5\275\364\010\324\275\211Kv>\334jc>\257\217F\276,\016\232=F\021\212=\373\'\r\2763-\036>\303l\325\275:!A<G\350[=\1778\352:\016\002\007=0y\210=\330\353\030\274\354\222}\275\261\177\216>B(\307=>e\373\275\351\323\024>\035\002e\275\'\276U\2744u\t>\321\335}\274V\240\343=a\004\267\275\024\"\003>>\3065>\235\022\220=\231\353\326\275_\305A>\023\304\221>I\207r\274f\371\034\275/\247\033>\226\366U\276?\032\213\276\321\303\245\275\242O\027<e\004\353=\036\016\206\276\031A\213\275 \217\217=\341\tu=t\372\272\275\353Ok\275\336\343\225\2750i\215\276\'\232\006\275<!(\274R\226\003\275\007\332%\276+\343\017\276\344\340\004;\274x[\2767y\312=\221k\t>\213\200&\274\\\014\362\274zQG>\2009\312=\3761\302>\342Q\237=\226n\022\276}\024X\27664?=K\203\361=G`B>\366\321p\276w\3573\275K\215\303\275\276\353k\275/\323\271\274\213\370\327\275\362\3055=\254\250\025<=\354\320\2756O\257=\350\375\376\275\263Q[=\r\344 \276_N\216\276R\036\243=\347q\357\275\021r\353<6\006g\275\317\341`=W\237\307\274\335\271\345\275(\231\230=\2046\333\275\276\313\n=*\"\221\274\363\2232\275\031\2322>\273|\215=\nx\334=\304\032\211\275\026\331\253=\034e\225\275\355\026|>\316\374\037\273\277\255\225<_\331\304\275\351\307^\274($y\276j\240x>\r%\231=4\025\005>\305K\355=\344p\247=\016\377\363=\326a\t>\r\200\362\275\323\212\203>\r\250u\272_\000\257\275\276 \017>e\210\206\275\274N\007\276/\313\033>\336\357\017>\372B\360\275|\006\024\276f\026\177\275\217vj=\226\3723\276\t\340\252=7\277\014=k\344N\2760\330\365<\264\376\203>\333\225c<@\354:=\356E\207=\037\016>\276\205\217\345;xr\243>\340\246r=!Y\362\275C\265\314\275\312\325\325=F\314U>,4J\276B\342j\274\177\361\222=,E\217\275\032\006\016>\343\312\312\275\240\360\303:\301\350N\276\216\237\333<\274o%\273\033-\n\276`\t\216\276 J\033>-r\303<j\253\274\275\032[\004>|&\332\274\000\245\036=\225t\315=\024\324\016>+A3>u\224\321\274\365\236\201:\241\234\224\275\231\221\222\274,\211\224=&V1\276\327O\320=\275\352\n>\321\023%\276\267a\007>K\272\311=\325\317\022\275\340$\006\276P\'\241\275\374w\276=\210\374r\274g\204\014\275\222\233\"<\r\350a\275T\343\344=\212\374H=s\242\274\275<\245\016>\177#\247=2s\353=;L%>\005\337\031>4F >\2664\206\276\024\353\355\275\324\313\035\276\373\265+\276e[\036=\352\005c;\020\231L\276\236>\226=V\320\215\276\263R8>y}\202>Y\215\273\273\037\025\003\276\236#Y>\016\022\201\275\205\217\304\275\020\253\203=\341\032\212<\372\356\352<A\233o>\314%u;\236\201\366\275\256\203.<b\303H\276L~&>A\347\232\275*\350t\275\'$\023>\235\323\247=U(\267=\2205\210\276,\2619\274\222\257\243=\310\010\356\275\376\250\210=\351//>\344UX=\353G\243\275\034<s<f\t$\276\334\001\332\275:\251>>\355\312\325\275vb\264\275\267\177\215<k\367\255\275\017\276\"\276qr\316=\005\256\211=\253\266J\275@\246G>\013Z\034>\230e\271;5O\233\276v\321\n\276\311r\321\275:zl\276\232\240\037\276\312e*\276\312\272\310=\240\332\335\275\374\024\001>\220\\3>\330\205;\275L\3332\275 \223\271<\250\242\033>\272\345z=\202U\300\275\230\245\224>\322\222!=l\345\304\275\2776\243>\211Dn\276\311\013\244\275f\261\212\276\236\030s<\375R\036=C\356\310\275e\311P\275@X\275<\345\025\007\276\005\311\200=B\031\361;\226\024\306=\3323\275\275\353\300\032\276\361IF=U\243\214=\252\230\257=\024XS;8\307\335=\'\245\336<!\346\366\274\023\255\t\276\311\271\364\275\356j\315\275\363\334\225<\345\277g=0:\300\275^xx=\300bI<\n\016e\276\307\233\237:\356mK\275\234\323%>\372\343.>\243\350g=\363\301\322\275\307V\223\275A\361\021>TOK\276\200\025h>\311\020\222\274\345\253\n=}\320\364\274\035\216%>\033\035\300=-\261\014>\243M\203<\314V\254\273,\255`\275\363\372\037><\t?>\220\217\330=\001\217\227=:0A>\206\321g>oo\221\276\300\014\026>\374\224\021\276\261\030\367\275\200=\201\275TP\247;\267,\027>`\036\301=\350\231\027\276pT\317<\034\345\337\275r\335p\275\273\222\026>\267\322\024>\311\234\373\275h6\312=A\306\247<\237\310E\275o\256\347=g$\344=\362K\231=&\013\201\275I\243\226\275\233\023v>n\253\'>\342\275\360\275\nB`>w\226\206\275\305wz\276:P\225={_\021<N\252\224;\222\356\034\276&+?\276\277\370\356\274q\360\223=<D\260\274\363\367\333\275\256\345\351\275\326\3203\276\350\030O<G)\024>&\357\203\276F\223\233\275\036\025\341=\303\211F\276\306\377\247\275\232\216\r\276\301rC:\021\002\221=\332\265\177\275\271w\362=\256mO<}\345N=n\244\006=\3740\216\275\302\016v\275\334@\272\27592J\276C\270\n>\233\261\251\2741\0070>t[\311=\347/\211\276\006j\205\276\337`A\276\363G\270=\"\t\212=\337\216\321\275\256\333\004\276_\224f<\005]+\273\256\321a>\252\231\262=?\237\374= \320\307<\017\254 \275\247*\275<\322\362\250\2748~\257\275\374h\n>\367\202>\275\303\354D>\236|(\276!-\264=\027\317\205>\244d\206\274\330\3046=O\237\226\275\247\037\202>\300\t<\276\254\275\246\275\332\034(>\235\333\025=\350\2438\276\274\252#\276\334\221\306\275\027\n\n>c\317\256\274jpa>\007/\317\275\307\007x\275;*\353\272\313\270y\276\010\367\361\275\001`\352\275\2470\034\275K\2033\274\223\337+\275?<\330=B\312\270\273F$\003\275\202\223\010\276\200?z\276x\236\247\273a\342\027\276\355\215f>\335\241\026\274\314\330[\275\346d\003\275\372\371_>g\275\021>\300\030\035\276HFB\276\030\203\026=\220\215\245=\214\376o\275:\362\021>\365\225\254<\353L\244=Or\202\2768\255\006>\341\232\335\275\336@\2477\030;>=h\227x\275\200t\210>k\207\306=\3109\3639N\016\000>\232\027\036\276\030\240n\275:,\363=K%J\276\211Fz:\020+\247=54j\276\251\270\025>\037\346\036=\207\2362>\344o\221=\254\316\257=\333Qv=\271\n\024\276\274\207\203\273\325Z\263=>Q\250\275\213\245\225\275\370\177\334=\3535}=\203\2134>\221\206\370\275\215\321\t\275_n\350\275\311\311\246<\226E\375\275\240#\014\275[p\023>Q\300\030\276bk\257=\273\301\010\276\346\034|>\201\017\023\275\032\273[\276G|\374\275\350\342\365=#9@>\374WD\276\345\270\373<\377\356\240<\306\333e=#\321\372=$\272\302=pE\026<\362F\033>O\3237\276\333\255F\276^\273\025>\021\2018>\320x,=\014\016\027=\315*\000\275\352\233S=q\265\253\274\271G\257\275\206\373\204>\353\302\271\275+B\227=\210\036\227<Th\247\275\244^\200\274\335\007*\276B#R\276\336\351\022\276;x\017>\250\252\207\275 \317U>\357=R\276\207\020n>C\261\034\276Q\2371\276\375\216\030\273\364\226\275>\204\276\235\275u\261\333\275 \217c=\346( \274\363h-=\217\235\237\275\265`\370\274\273\306\202<\224\200t>0\210H\276`Q\277=Wc\014\276\316\202\216=\247I\010\276\031\035{\276\034g\001>\375s!=\010\314\265\275>\370-\276#N)\275\320O\362\275\252\200\342\275\276\370\327\275\375&\373=K\360\254<\260^\013\276\225\313\352\275\240\363\267<o|\177>\330\316\r=\017\362@==\240W<dn\364\275\371\202\213=\315\367$\276\340\3604=\022\007\200\273\030\002\013>r\306I\275\304\370S\276\307\344W>3W=>\371\360\355=f\316\357<m\177e<s\242\212=\340\201];\304\272\002>\251\031\224\275\234W\362;_\245\370=C\016\305=\254xZ\276\211\007\272=\014o\314\274\210\340\005\276s\216B\276\205,\030>1\264E\276\331*\222>\020m\371=\333s\301>\320C\223=\321\005\365=\223\367\026\276\363\t\355=\264\000~>\001r/=\362\246\255\275lqP\275\3128\245\275\233\312n\275C\020\351\275\013m\034\276Kf\261<\305J\001\276X\367\022\276\005\276\017>\255-8=V\354\031>\004l\315\275\026\250\272\275\274Y\213\276\331\271c\272\373\366\252\275\356\n\013\274r^\">.{Y<Tm\322\275|+\270\2749v\023=\030\356\355\274\034\026\016>\024#\240\274&V\316\275W\335i\276X\356\205=\032O\022\2768K\027;\203\0026>\023PH>QtZ>\372\317\264\274f\036<\274Lp&=\364\205#\276\033\336h<\367\330o=c\235\236\273\304\267\362\275\027\323\336<\347-\304\275\030\246\206=\306\035\013>\3227\004\276\234\202S\276\310(S<\304\207\245\275Y}\031=\234\277\r>\234\364\346\275\027\271Z>\272Vy\276d\315o;\010\0362=\234_?\276\0171\320\275\034\"\006=-\007O\275\265\3331>\342\331E\275k\024q=\261q\265<\037\270\272>\377\r\322\275@\330.\275\366\303\252\275\251\036{\276\274\2229\276yK\262<6\222\336=\026\302\316\275\016C\327\274\3658\214=\272\236\003=\323\222\311=]\227\311\274\231\371\311\275\\\345\003>\234h\312=\026\227\212\274H\250k=\203\022\030>\244\004\037>\344\203\353=\021\032x=\373L,=g\214A\275C\246\014\273\213g\276>\307\014\251=>\027\n=\025I\246=\362N\377<\212\224\326;\227m;\275\234\265h\276\325J\177\273\223\3111\275\304,\367\275\303\356\223\276\263T\240\274\200\n\020\276\'\226\\\274\r\255\227=\235o%\275\213\010\346<qIT>\326d\236\275\2141\027=[\306\221=\256\245\006>\366,\037=\0316\303\274\0312_>;\031\371\275\204f0=\217.\226=W\362\316=\336L\230\273|G\355<(\177A>\256\275\024\276Yw\025<\202\271\226\275t\210\212\276\010\244\205\275\233\332\270=\216p%\276\276\336\256\275\331\025f=\\\210Q>Z\007K\276J\320\033=~ \303<\030j9\276\177\372\275<\352\267\316=\0234\345\275\305\236w\275;\t\214=b\025\220=\204\267d=_\315\223\274\225Q\t=\026\336\025>\222\2773\275\366\317\217\275\352\265\246\2752\245!\276$\245\352=\016b\200\276~~\365=@9\224\276\314\304\334\275\016L\241=\357\351\335=\312\202\274\275K\231\031>\261\366\027\276c\235v\275\315\231z>\247#S<\214\035:>\343\240w>\275\227\336\270\305w@>;V\302\275\212.B\276"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_1"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_11/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_11"
  op: "StridedSlice"
  input: "net/Shape_1"
  input: "net/strided_slice_11/stack"
  input: "net/strided_slice_11/stack_1"
  input: "net/strided_slice_11/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_2"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_12/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12"
  op: "StridedSlice"
  input: "net/Shape_2"
  input: "net/strided_slice_12/stack"
  input: "net/strided_slice_12/stack_1"
  input: "net/strided_slice_12/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones/mul"
  op: "Mul"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/Less/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "net/ones/Less"
  op: "Less"
  input: "net/ones/mul"
  input: "net/ones/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/packed"
  op: "Pack"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "net/ones/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones"
  op: "Fill"
  input: "net/ones/packed"
  input: "net/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
