node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 2235132
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\234B\311\275\022\254\217>\317R0;\341\304\266\2751\027\270\275A9<>\365W5\274\001\327\242=\235Y\272\275\246\177\300\276\023\265g;\253\2570=2\324\341=7es;\317jL=\353\002\234\273\027\324\234\274r\350\177\275V\220Z\276>\334K\276\362#\315<\331\252\365\275z\320\"\2764B\334=jx\267\273\310\\5>|\362Z:\210ye\275L\253P>)\034\277=|\035\016>\254\353<>\021\345\033=6\177\317=|\350\203\275@\301h\275\313o\224\275l\340\003>\334\355\256\275\330\003\377=BT\202>\310\253G\276\220\"g>X\361\275\274%\006g\276l_6\276\177|\034=/rM=\031J\317<\365\\p\275\363\337\034\274\210\243\376;\027L\326;&V3\275Rm\251=\253Z\242=\327\216\017>^C`>\225!\030<\214\247\t>\234\006\\\276&!|=\325xj;\330BC\275m%V>\340l\232\273\266\360R=e\217\r=*N\331=YJ@>\265< >j\227\353<\0269c=\021\030M\275\262O\361=,\030/==\3125\276aX,\275/(\221=\016\314}\275\004\233\000\275\242\032K\276\306\315\022\275\006\206!\276\007\373 \274\320\304\005>U\3444\276s\320\221=R\373\342\276\200\364\223=\243|\365=%\344\265=\3308\247<\032/\203\276\337x\307=\010\221\231=\273<\330\275%\010\006>cW\007;\020\252\014\275\202\241\362=\374\013\214=\331$\r\276;\331\241\275-H\230\276\254\352\212=g\246\001>\026\334\234\275Y\204g\275\'\261\357\2756\301y>E|\353\275>\327Z\275p\n9>\273\374\356=n\3705\274\257\266\200=\037T\224=\036\243`=\277.\224<\\\364\005\276\273R{>\301<V>\037M\021>\'r\307=5v\274=\000\267\217\276\\\364\023\276S\325o\276\3114\\\276\302w[\276~m\210=\336mn\275\002.\230=\004\311-\276\321\014\257=\301\025\335<\310\364{;\314T\334=\306\201w>\246\005\323\275EmS\274\034\207\256<\304\3107\275Ny\224=\267z\341=\343d,>\227j\r\275\274\267;\2761\202\021\276\'F\013=\314%\302\275\3722\240\274\230\003\327\275E\353\262\275O\320\023=\'\351\261\2753a&>6R6=\3040\n>\245NH\276A\240><\'\223=\275b;\246=\302\331J>\230\245\t=\035\350\333=\346\265P\275\216\262\030\276\370\007\214<\017\327\352\274\2125\342=\236\204\330<\r*\017>\366\263\r>6{\215\275\274/\252\275B>a>1~6>\215`\252=\276\372\026=S{\036\276rlH=qj\224\275\200g0\276==\205>\230t\200\275\211\265#=|9\206\275\3439\335=\211\020\332<3.\000>\031V\333<\245\321C>X\020\'\276\033\374\n\276\013.\n\274P\203\325\275\252\330\n<Q\201h\276\315\224\320\275]F\345<\233\034\211=\242\326m\276\266\031U\276i\266\334<\303\300 \274\027t\202>\312\221\332=\307\214\035\276\313l\362=\256\212\004\274k\350\236=\305\023$\276\216\366\322=<\224\232\275Z\312\t>2\324\006\276\033\332\006=\346\\\271=\271\250[\276u\365\354\275\206\340c\275z\214i\276\335\t\n=\366\027\014\274R\373m>\355\255\357\2730\302y<\315\205r=\003\356\001=\'\006\316=D2\234=/,\341\275\320\010\337=@\250\352\274\325n\262>\340\221\033=;\255\n>\234\337\313\275\007\232\306=\2376\355\275J#\365:\251\216Y\274\327].\276\333=\037\2753.\224\275\261R\"\276l\342\036=\031l\363=/\277V\275\344V\021\276\305w@\275}\017\016>\244m\307\275\221\361\005\275r6\274\275yc\221=\0057&>y\365\347=Yl\316<\353\001\016\274\353O\034\276\316iA>J@\363\274\351#P>O\276\307=\243`;>\254{\275\275\356Y\">\273+\023>\177wA\276\205\"\303=\325Ay\276\202.6=\246\033\234\275\322\205u\276\227\311\330\275\034\0379=1y\224=(\332\366<L\373(\275\007)g>\375\334A>\nj\n\276\177\207q\276 \205\231<\2162\251\274\316\266\212\274\324\013\025\276\252\\\266<Q\273~>\0044\306\275\221\024\357\275\363\301;\275l\217<>\356\366\223\274n\341\202\276_\013\246;=\274:>\311D\245\274i\370\010>\017\222\262\275\335\t\005\275\216%O\276\260Z\337\274\236\221w>\377\026~\274Z\212\246\274r\267\365=*\005\355\274\301\357\262\275q#\200<J\200\312=\341u\260\275\214u\237=\036eS>U]\341=\017\r\220\274L?\346\275\353A\n>\260\205$>b\3538>a]\241;\002{\223\276\206\225\277=\362\207\n=e\200\221=\010\3302\275n6\n>\2075\216\275\260Rt\275\310\200\t>\231\337S\274\225O\220>\2603x\275t\302?\275\374r\215>\252\335\024<.\360\352=T\324\355\275\303v\003=\036\025\021>d\002\212=\253\376\374\275\006\251\253=\210W\212\275f\243m>\336s]\276\205\357c>i\177\372\273P\002\274\275M\037 \275XJ\270=;\300k=\205/A=c\265}\276\260)@>,CR=\254[\033\276\273\036\252\275\031\205\251=\'\014\300\274\232\220\265=\310\221\331\274g\270\244\2753j\314\275\345\n\333\2752\\\263=\366\277\267\275e\n\\>\203\034\252=\232\327\340<\351\324d>x\222\305=\010b\371\275\310\264\260<\221R\260\2750*$<\200O\014\276\333\257\002\276\360\224S\275\350\326\255\271\315\322/\275?\007\337=z\214\342=N+\366=m}b=\032\367\207=\210\216L>\236N\261=j\200\035\276\250\3447=\204\233\331\275\303\304s>\362\302b\275\n\322\035>\320}\357;\257\222(\275\3132\224<\356\250|>\227\307\306=\2648j\275u\005\360\275$\322\327>\276\214\027\276d$\'\275|/6\275\306\345T>\034/\305\275\013L$>\267f)\275\'\256\017\275=8\232\275-\310t<\322\374;<\027\250\260\2760\306\302=\232\343$<\351\342B\276i\260n=\257\370\261=\351\316\230=\017k\255=3\303#:*\205\257\273\200\362\232:)0\031\275\377P3\276fe\324<\025w\014>\"c\237=SX|\275s4\274=hl\003\276\221\271\206\2758\"6\276\261X\206\275\374\002\314=\355\357\312\274^\322j\274\344\027\217>!\271\t>\343@!\276\003U\261\2758!\271\275\377\303\017\276\204\317\234\276\342^\305\275u\242\347\274\027\225\010\274\000\265Y\275IB\\\275\021E\373=\214\360M=xz\303\276&\344\255\274\302Q\320\275tH\222\276\274o\220\276r\271\016=]\2125;\214\363\212=-T\307\272_`\374\275x\274k\276u*\342=\302\230\311=\014\220\220\275\006a\230\275x\345\235=\356\236v\275\276\001o<T\351\235\275dE\223={O6\276\222\225\023\276\357R\036\275{\376&=\276Ko>=\231\033\276Z\020\205\275\217\024\016\276\177\310\327=\311\007\036>L=\203\275\246*;\275\320_}>\234\344O;\260A\302=\263$\037\276m\005$\276\343aZ\276\376\347\201>\030\363\267\274\362\037\271=\242\247\216=$\"\t\276\331\326\020>\3054\242<\330\002\034\275\200F1>|\335s\276\325\031;=%\341\334<\341\026\000\276y\361\250\274]\326\275<&\212\331=\333\311\302=\364\341=\276\224\236\323<\355d\333==\250\010\276\006\037\203=\245\377\032>\337\003e>\211\336\223;\305W\002\276\001m\221=\212\201\270=\363zX=.\324d=\010E\205\276n\224\205\275\003\243<\276\366\360\377\275\220\350?\276\270\363\212\276\252\351\210<1\350\215\275\014\360\020;J\303\007>\254|\312<\r\325w=D;\262\273Y\323(=\267\026\013>\216\\\241\275\353\300R>\201\343x=^ \362=R\030\244=I;\222\276m\037\201>\252\253\203\276\360\225\225;*q\r\276%~7\276\206\201\313=\202\002\332\275\357\010a<\200F\270=\227[P=\320\027\276\273\226\3628\276\"\344\234<\365\0371\273\022r\260=B\307\360=\301w7>\343s\275\276i~\203>=\372\026<\202\357\">R\323\t\274\244\276\310\275D\200\006\276\333/\202=]MC\275\2530\367=v\255\201\275[\341\242>\007\211\224\275=\332\361=C3P=4T<>\"u\342:~vu\275\245\224\312\274\004\220\036<\254\3166\276\213\013\257=\260\362\210\275p\372\"\275Dp\366\275 >=\275 \247\215\274de`\275{\344M>\277\206\014\276\344\334\303\274\340\210\"<_\342\n\276*\002-=\350\216\375\274\363\251G=\t\357w\275\337\210^\274\237\222\022\275\221v\357\275\211\203\337\275&\266*\276e\223\270<\005f\020\276\311\351\340\275\273\325\022\276!v%\276\233,V\275\267\314\017=\256q\316\275)zT>\276\314\341\275`\303\013>\305\325-=\305\352\213\275p\243`>\340\240\352<\007\363\'\276X\255l=9\213\014>\274;\232=\373\036\240<6==\275\216\260X>D*\245=5\302\243<R,\020\276V\347\212<<X\010\2753W\032\276\251 \r\276\007W\000\276\354q\275\275\034\217\322<\275\246\000=\354?\240=\037\017\312<1]\201\274?\213h=\0039\235=\370k\025\275]4\224=\321\3303>\206\262\226\275\212\"\277\275\375\034\240=Z\265\034>\351l\020\276eK\233\276\326\010\307=\343R\260\276W\233\333\274c\226\001>t\303\236\274\365\nM\275\265\333\256>\nS\300\275\004\2573=zqR\276\022\r\202>\016A,\276\276[\317=\343Y\224\275\002NR\273z]\354\274\374U\271=\215\321\033:\'\336\001\275\005k\232\272\302\315L\276\2368\210=\373\365\353=|+\326<\007\220+>\374q\332=\375$\336;\265\364&=\232\007\002<\34259<\225=i>{\233C>\036P\022\276\242\372g\276\177\365\210<\247\n\214\274,\352\247=\2261<\276\220b\010\273k\005\037=\004\250&>0\247\'\275\351Z\345\275\007\211C\276%\010\003\275\240\0305<o\032>\276_\035\246<\202K\033\272@\254Q>\274!\313=W\016\341=)q\230\275\221\004O\275`\270B=4\207\032\276\324z\311\275\3338\034\275\302\267\224>\306\356\237>\211\200O=q\324j\276\265|J>\0028l=QBK>\'\205\205=\217&\316<\030\321\300\273,#\r>+\234\373=\363[\207\276\235\"[=\245\323\273\275\274\321\375\273\233z\277=\246\345\250=\373\361>>\350\261\252=\306F\r>\253-!\276\323\tB>fs\332=\261\331\\>C\316\257\275\305\216\303\275\366w\270=\250\037+>\354\251\037\275\240GD>\311{\032>d\305\376=Og\225;\205\353,\2768\3078\276\317\206\265=e\236\314=\273\200\214=/.\372\272\245\256c==\2208\273\307BG=\336\367\234\276:\007n=\271\250\014>\253Y\237\274\272!1>\330\000\t>\223N\247\275\305\311\036\276\017YZ\275l\276|\276\232\300\351=\016\230\026>\354\345\021\276\261<\257\275_\005\325<e\023\325<G\377O>9\007\342=\250\006|\275\206\370@\275w\210.<5d\275<\312o\376\273G\241)<\371\274\027>{\224\303\274r\243I\276\023Ni>\260;\312=D\316\233=\355$\204=PW\3209?\361\344=S\243\331\275\343\365T>\030 \000\274\004\006\244=\217\\\250=\231\271S>J\310N>\'\r\326<\262\225\353\275\353\322[<\243\026C>\257\353#>\246\323\026>v\262\211\275\rf\375\274\352\255i=\227\300\022>\305|~\276e}A\275N\344\032\275\206\300\017\276\rk{>\310\275\r\275\261\252\336\275\003$\314=\216\245<\276L\270\017=[ZU\270T\216l=\203\242G\276h\315F<\311%/\274S\333M>&\333H\2769\005w\275O\347\030\274\274A\357=VyJ\274(\214j\275N\271\235>\321L\321=W\202\353\273\263\006\002=\004\023\264=e\352\"\274\205\230\326=ON$\276\354&T=\312\300\217=\002\231]>\023\0027\276\253\314Q\276\301Sy\275/B\235=;\274\336;k\000\203>\257\265\367\2743\001\252\276u\314&>\302\330\026\276o|B=\2575n=\246\320\204\275\t&>=\232=\025\274_\300\025>\353N\257\274\036\005\237\275\235]%>f\034\306\272\223\364\240=c\237N\276\366\363\326=\224\301\031\275I\335\002\276W\377\026<r\307\256=B-\272\275OQ\304\275\276.\323\274U\236\022>\227\360C>\315\330\216=\006:=\275^\234\301\2745/\323=\034\246\251\274\037Z+>`\2244\276\235E\312\274\265)\020\275?\201>\276\342\317\217=\346\237\314<gz7\276I\212\205<\320[&\276\324]<>\007<[=\233=\267=\254\004\243\275_\2611>\241</\276@\204^<\311\232\000\276\2659s\276\2218\021\276\332\326\001>\021\350\023>F\355\204\276\350\3765>^N\310\275\311\017<\276\326hT>\273\354\327=\270\247\037\275\307\365\014\2767\0077=\021\225\202>;r\021\276\000#0\276\307\223V>r\r\025<\224j)\273`!Q=\254qn>Hc4\276\327H\252=\232\206f\276s\303\250\2750:E=\034?\315=\271x\310=TL\346\274\017\275\036>\260s\375<O=\010\275\025\323C\276H\206\3318\0224c<\360&\206\275\020\211\212\2760\270\207=t<[\276\350\345\230=9Xj>2\355N\273sZ\033\276\307\216\200=>\261&\275\027%\362\275c\305\005\276.\206V=\275;\021>\n\313)\275I\342\356\275\321\251\241\275\010V\177=\236O\000\276X\006+\275\361qZ<\211\013\017\275\374\364\262\275)A\002>\250!;>Cm\366\275]~\305=\023\220\224;.)[\2768\335\211\275}\265\n\275\001Js>\331z\010>H\231^>f\030\365\275\203\274%=\216\200\211\275\207W\327\275h\223\306<\225\253H>A\222A>!&2=\306\220\272=\353k5>\342\273\000\275\350\321\262\275\035\242\326\2755>A\276+\t\305\274l\333\314\275\375Ep<E\335\243=\227)\271\275\324r@>:\036a=_Q\237=u\203\337\275\025j@\276\211\356\277\274\324<\213=\263\'\260\276\030\250`=UA\362=G\315\255\275\245\'\n=\240Q\000=>*\206\276\215Oh<\013W\007>\272\005\262\274\025n\233=\332\006\364\275\356\370\313=\216U/\275\353\262K\275-\266f\275-\3552=\2338.\276{\244\262=\302\252X>v\333\206=\300\026f\275\372$B\275\265\235\337\275f\0251>\256\221}\275\371\372\001>$\177\032\276\322^\370;\221\240\306\275\006\275u>\317_v\2759\201\315=\027\357\342\275sJ\247>\221PX\276\003\203\035=\002\030A<\343\277\262=\255)\312\274Civ<8\034\356=\277\233\\\276]\214?\274\343\316\242=\327\367\361=\224\233\035=m\306\306=z\027H>rR\212=)\363\316=\244\344\204>)h\223=\017F\304\275\232:[\276\327\364\252=\\\236=\276/\316<>*V\202\275\244\232\270\2752\327\367=\271*d=y\321\201\276\304\207-<#7Z\274\262h\364\275\230>\230\276\361\200\234\273J\314*>\257\374`\276/\352\310\274\342\264\212=4F\345\275\270\346\336=}\017H=\323/\240\276\260\342H\274\322\203]\276\307#h>\\$\013<\224V\344<b\014\340<\017K\326\274K\010#=\202\"\361=\201\301\266=Z\200\334\275T^D;\332\351^\275\342\333\005\27624,>U\364\'>z\344\336\275\252\344\004\275G\326\322\275/\343\226\275B\256-\276\207\360,\276\377]F<hv\013>\274~*\275u\037\010>g\303\262\275\217\276]\276}\244\202\2758\026\377=:\377!>\272\316\306\2757P`=[\266\036\276\3657~\276\\\213\315\275%\307T=\243\010\225=\242\333\351\275\327\356\307\275\315\035\266=\177\021\022>\224uh=/.\302\273\354\273\223\275\370\035\356<\351\036>>\352/\224\276\271h\227\274\206]\007\276\340:?=\270\2571>\365k\234>]\307\024\276;\220\201\276\014\0216>\216\336\035\274\233\352\325=E\264\203\275\375\216n=jFW>\332c6=\332\365H=\2672]\276\261\260r<3\245T=\335\212J\276\271\234\314\274\370\217\223\274\205\'6=\017;\n>= \207=k\267\023\276&\310\017\275\014\002\024\276\262\216\207\275zi\273\2740\211\335\275\367x\313=\215\223\334;\026g\216\275\246\036\202=s\037\203\275\366Hq\276VH\025=\261xk\275S\226j\276\005\317\257\2758\237\337=\'\231\303<\221Z >\306\031;=\250\365|\2755P\311=\263\227O=\272\314\215>\024\213\232;\214@!\274N\231\376\275\356\254\027\276E\030\205;\311w\314\275\222r\246\272\36617\275\362j\206\276\305jE\276\327u\005=-\234\006\276\213\034\220=3\272\367=|P\370=\177q\363=\314\216\227<\353@\316=k\272\276\275\206`\000>\276\2249\275\233\035\277=\231?\202>\211r\020\275f\231\266\275(wL>_\264\316\275)j\302=\375)\216=\232\345g\2769$\222=l\305&\274\017\362{\2761\351\300\275\226\220\027\276gh~\274\313\313\026>~\002\"\276(\034\t>\027\2023\274\234U\227\275x\323\207\276?\270N>\257\260\340\272"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_1"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_11/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_11"
  op: "StridedSlice"
  input: "net/Shape_1"
  input: "net/strided_slice_11/stack"
  input: "net/strided_slice_11/stack_1"
  input: "net/strided_slice_11/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_2"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_12/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12"
  op: "StridedSlice"
  input: "net/Shape_2"
  input: "net/strided_slice_12/stack"
  input: "net/strided_slice_12/stack_1"
  input: "net/strided_slice_12/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones/mul"
  op: "Mul"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/Less/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "net/ones/Less"
  op: "Less"
  input: "net/ones/mul"
  input: "net/ones/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/packed"
  op: "Pack"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "net/ones/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones"
  op: "Fill"
  input: "net/ones/packed"
  input: "net/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
